mhdfoam/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1812                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    inlet
    {
        type            patch;
        nFaces          1089;
        startFace       383031;
    }
    outlet
    {
        type            patch;
        nFaces          1089;
        startFace       384120;
    }
    lowerWall
    {
        type            patch;
        nFaces          3960;
        startFace       385209;
    }
    upperWall
    {
        type            patch;
        nFaces          3960;
        startFace       389169;
    }
    frontAndBack
    {
        type            patch;
        nFaces          7920;
        startFace       393129;
    }
)

// ************************************************************************* //
