mhdfoam/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.0.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    "(p_rgh|p_rghFinal)"
    {
        solver          GAMG;
        smoother        GaussSeidel;
        preconditioner  DIC;
        agglomerator    faceAreaPair;
        nCellsInCoarsestLevel 1000;
        cacheAgglomeration true;
        mergeLevels     1;
        tolerance       1e-07;
        relTol          0;
    }

    "(p|pFinal)"
    {
        solver          GAMG;
        smoother        GaussSeidel;
        preconditioner  DIC;
        agglomerator    faceAreaPair;
        nCellsInCoarsestLevel 1000;
        cacheAgglomeration true;
        mergeLevels     1;
        tolerance       1e-07;
        relTol          0;
    }


    pB
    {
        $p;
        tolerance       1e-05;
        relTol          0;
    }

    "(B|BFinal)"
    {
        solver          GAMG;
        smoother        GaussSeidel;
        preconditioner  DIC;
        agglomerator    faceAreaPair;
        nCellsInCoarsestLevel 1000;
        cacheAgglomeration true;
        mergeLevels     1;
        tolerance       1e-07;
        relTol          0;
    }


    "(U|UFinal)"
    {
        solver          PBiCG;
        preconditioner  DILU;
        tolerance       1e-05;
        relTol          0;
    }

}

PISO
{
    nCorrectors     3;
    nNonOrthogonalCorrectors 0;
    phiERefCell     0;
    phiERefValue    0;
}

BPISO
{
    nCorrectors     3;
}


// ************************************************************************* //
