mhdfoam/system/sampleDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.0.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      sampleDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

interpolationScheme cellPoint;

setFormat       raw;
surfaceFormat   raw;

sets
(
    y15
    {
        type    uniform;
        axis    distance; 
        start   ( 15 -1 0 );
        end     ( 15 1 0 );
        nPoints 100;
    }
    z15
    {
        type    uniform;
        axis    distance; 
        start   ( 15 0 -1 );
        end     ( 15 0 1 );
        nPoints 100;
    }

    line_y
    {
        type    uniform;
        axis    distance;
        start   ( 18 -1 0 );
        end     ( 18 1 0 );
        nPoints 100;
    }
    line_z
    {
        type    uniform;
        axis    distance;
        start   ( 18 0 -1 );
        end     ( 18 0 1 );
        nPoints 100;
    }

);

surfaces
(
    shercliff
    {
        type            plane;    // always triangulated
        basePoint       (18 0 0);
        normalVector    (1 0 0);
    }
);

fields          ( Ux );


// ************************************************************************* //
